package utility

import (
	"github.com/gin-gonic/gin"
	"strconv"
)

func GetHexagramSequenceTable() [64]string {
	return [64]string{
		"乾", "坤", "屯", "蒙", "需", "訟", "師", "比",
		"小畜", "履", "泰", "否", "同人", "大有", "謙", "豫",
		"隨", "蠱", "臨", "觀", "噬嗑", "賁", "剝", "復",
		"無妄", "大畜", "頤", "大過", "坎", "離", "咸", "恆",
		"遯", "大壯", "晉", "明夷", "家人", "睽", "蹇", "解",
		"損", "益", "夬", "姤", "萃", "升", "困", "井",
		"革", "鼎", "震", "艮", "漸", "歸妹", "豐", "旅",
		"巽", "兌", "渙", "節", "中孚", "小過", "既濟", "未濟",
	}
}

func GetHexagramPostionTable() [8][8]string {
	return [8][8]string{
		{"乾", "履", "同人", "無妄", "姤", "訟", "遁", "否"},
		{"夬", "兑", "革", "隨", "大過", "困", "咸", "萃"},
		{"大有", "睽", "離", "噬嗑", "鼎", "未濟", "旅", "晉"},
		{"大壯", "歸妹", "豐", "震", "恆", "解", "小過", "豫"},
		{"小畜", "中孚", "家人", "益", "巽", "渙", "漸", "觀"},
		{"需", "節", "既濟", "屯", "井", "坎", "蹇", "比"},
		{"大畜", "損", "賁", "頤", "蠱", "蒙", "艮", "剝"},
		{"泰", "臨", "明夷", "復", "升", "師", "謙", "坤"},
	}
}

func QueryInt(key string, context *gin.Context) (int64, bool) {
	str := context.Query(key)
	if str == "" {
		return -1, false
	}

	value, err := strconv.Atoi(str)
	if err != nil {
		return -1, false
	}

	return int64(value), true
}
